# Найдите сумму цифр трехзначного числа n.
# Результат сохраните в перменную res.
# n = 123 -> res = 6 (1 + 2 + 3)
# n = 100 -> res = 1 (1 + 0 + 0)

print("Напишите цифры")
num = int(input ())


res = num // 100 + (num % 100 //10) + num % 10

print (res)
   


